# GetDefaultOpacity

## Description
Returns the default opacity.

```pascal
PROCEDURE GetDefaultOpacity(VAR opacity : INTEGER);
```

```python
def vs.GetDefaultOpacity():
    return opacity
```

## Parameters
|Name|Type|Description|
|---|---|---|
|opacity|INTEGER|   |

## Examples
```pascal
GetDefaultOpacity(1);
```
```python
import vs

# Returns the default opacity.
result = vs.GetDefaultOpacity()
```

## Version
Availability: from VectorWorks13.0

## Category
* Document Attributes